# What is Groupby in Pandas?

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(
    {"key1":list("aabbab"),
     "key2":["one","two","three"]*2,
     "data1":np.random.randn(6),
     "data2":np.random.randn(6)})
df

  key1   key2     data1     data2
0    a    one  1.704762  0.431409
1    a    two  1.333978 -0.408518
2    b  three  1.054929  1.252763
3    b    one -0.749981 -0.832776
4    a    two  1.111963  0.021468
5    b  three  1.101960 -0.208023

In [3]:
group=df["data1"].groupby(df["key1"])

In [4]:
group

In [5]:
group.mean()

key1
a    1.383568
b    0.468969
Name: data1, dtype: float64

In [6]:
ave=df["data1"].groupby([df["key1"],
                         df["key2"]]).mean()
ave

key1  key2
a     one      1.704762
      two      1.222970
b     one     -0.749981
      three    1.078444
Name: data1, dtype: float64

In [7]:
ave.unstack()

key2       one     three      two
key1
a     1.704762       NaN  1.22297
b    -0.749981  1.078444      NaN

In [8]:
df.groupby("key1").mean()

         data1     data2
key1
a     1.383568  0.014786
b     0.468969  0.070655

In [9]:
df.groupby(["key1","key2"]).mean()

               data1     data2
key1 key2
a    one    1.704762  0.431409
     two    1.222970 -0.193525
b    one   -0.749981 -0.832776
     three  1.078444  0.522370

## Iterating over Groups

In [10]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.704762  0.431409
1    a  two  1.333978 -0.408518
4    a  two  1.111963  0.021468
b
  key1   key2     data1     data2
2    b  three  1.054929  1.252763
3    b    one -0.749981 -0.832776
5    b  three  1.101960 -0.208023

In [11]:
for (x1,x2),group in df.groupby(["key1",
                                 "key2"]):
    print(x1,x2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  1.704762  0.431409
a two
  key1 key2     data1     data2
1    a  two  1.333978 -0.408518
4    a  two  1.111963  0.021468
b one
  key1 key2     data1     data2
3    b  one -0.749981 -0.832776
b three
  key1   key2     data1     data2
2    b  three  1.054929  1.252763
5    b  three  1.101960 -0.208023

In [12]:
piece=dict(list(df.groupby("key1")))

In [13]:
piece["a"]

  key1 key2     data1     data2
0    a  one  1.704762  0.431409
1    a  two  1.333978 -0.408518
4    a  two  1.111963  0.021468

## Selecting a Column or Subset of Columns

In [14]:
df.groupby(['key1', 
            'key2'])[['data1']].mean()

               data1
key1 key2
a    one    1.704762
     two    1.222970
b    one   -0.749981
     three  1.078444

## Grouping with Dicts and Series

In [15]:
fruit=pd.DataFrame(np.random.randn(4,4),
                   columns=list("abcd"),
                   index=["apple","cherry",
                          "banana","kiwi"])
fruit

               a         b         c         d
apple  -0.701474 -0.507510  1.001866 -1.044490
cherry  0.617902 -0.112837 -1.455978 -0.490739
banana  1.715762 -1.248636  0.578588 -0.047482
kiwi    1.908217  1.583175 -1.297205  0.452276

In [16]:
label={"a": "green","b":"yellow",
       "c":"green","d":"yellow",
       "e":"purple"}

In [67]:
group=fruit.groupby(label,axis=1)
group

In [68]:
group.sum()

           green    yellow
apple   0.300392 -1.552000
cherry -0.838076 -0.603575
banana  2.294350 -1.296119
kiwi    0.611012  2.035451

In [19]:
s=pd.Series(label)
s

a     green
b    yellow
c     green
d    yellow
e    purple
dtype: object

In [20]:
fruit.groupby(s,axis=1).count()

        green  yellow
apple       2       2
cherry      2       2
banana      2       2
kiwi        2       2

## Grouping with Functions

In [21]:
fruit.groupby(len).sum()

          a         b         c         d
4  1.908217  1.583175 -1.297205  0.452276
5 -0.701474 -0.507510  1.001866 -1.044490
6  2.333664 -1.361473 -0.877391 -0.538221

## Grouping by Index Levels

In [22]:
data=pd.DataFrame(np.random.randn(4,5),
                  columns=[list("AAABB"),
                           [1,2,3,1,2]])

In [23]:
data.columns.names=["letter","number"]
data

letter         A                             B
number         1         2         3         1         2
0      -1.900794 -1.882544  0.189891 -2.918616 -0.084454
1       0.231775  0.686539  0.498247  0.800803  1.471071
2       0.143840  0.437312  0.010508 -0.831717 -0.559720
3      -0.732167  1.184147  1.106008  0.444155 -1.951336

In [24]:
data.groupby(level="letter",axis=1).sum()

letter         A         B
0      -3.593447 -3.003070
1       1.416561  2.271874
2       0.591660 -1.391437
3       1.557989 -1.507182

## Application with Real Data Set

In [60]:
game=pd.read_csv(r'C:\Users\Lenovo\Downloads\ODI_DATASET.csv')

In [61]:
game.head()

,Unnamed: 0,",""Score"",""Overs"",""RPO"",""Target"",""Inns"",""Result"",""Opposition"",""Ground"",""Start Date"",""Match_ID"",""Country"",""Country_ID"""
0,0,"412,""250"",""48.3"",""5.15"","""",""1"",""won"",""v India""..."
1,1,"680,""165"",""48.0"",""3.43"",""251"",""2"",""lost"",""v Pa..."
2,2,"413,""157"",""48.5"",""3.21"",""168"",""2"",""lost"",""v In..."
3,3,"681,""167"",""43.4"",""3.82"","""",""1"",""won"",""v Pakist..."
4,4,"117,""198"",""40.0"",""4.95"",""306"",""2"",""lost"",""v Au..."

In [62]:
game.dtypes

Unnamed: 0                                                                                                               int64
,"Score","Overs","RPO","Target","Inns","Result","Opposition","Ground","Start Date","Match_ID","Country","Country_ID"    object
dtype: object

In [63]:
game.describe()

        Unnamed: 0
count  1296.000000
mean    647.500000
std     374.267284
min       0.000000
25%     323.750000
50%     647.500000
75%     971.250000
max    1295.000000